programming/sql/mariadb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mariadb</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">mariadb</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">mariadb on centos</a></li>
<li><a href="#sec-2">commands</a></li>
<li><a href="#sec-3">date and time</a></li>
<li><a href="#sec-4">notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">mariadb on centos</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>install: 
</li>
<li>start: systemctl start mariadb
</li>
<li>login: mysql -u root -p
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">commands</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>show databases;
</li>
<li>use database foo;
</li>
<li>show tables;
</li>
<li>source mycommands.sql
</li>
<li>show create table product;
</li>
<li>show create database foo;
</li>
<li>select * from foo limit 2;
</li>
<li>delete from foo; deletes all data
</li>
<li>drop table foo; deletes table
</li>
<li>show warnings;
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">date and time</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>datetime ; datatype
</li>
<li>datediff ; function
</li>
<li>timediff ; function
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">notes</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>commands written to ~/.mysql_history
</li>
<li>table names are case sensitive, data in tables and commands aren't.
</li>
<li>no space between function and (
</li>
</ul>

<p>
<a href="./sql.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
